app/controllers/movies_controller.rb

    def index
      # Part 1
      # Apply sorting on column present in params[:sort] by using ActiveRecord::QueryMethods#order
      # Reference: https://www.rubydoc.info/docs/rails/ActiveRecord%2FQueryMethods:order
      # @movies = Movie.all.order(params[:sort])
      # # Update parameter to change the backgroung colour
      # @sort_column_header = params[:sort]


      # Part 2
      # Getting all possible valuse of ratings field from the model
      @all_ratings = Movie.ratings

      @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','R','PG-13','PG'))  ORDER BY release_date